/*009. Вывести на экран четные числа от 1 до N
*/
int i=0;
int N=20;
while (i<=N)
{
    System.Console.Write($"{i} ");
    i=i+2; 
}
//System.Console.WriteLine(123/10) это выбрасываем последнюю цифру
//System.Console.WriteLine(123/10%) это добавитьб последнюю цифру
//System.Console.Writeline(123/10%10) это получение числа