/*Написать программу вычисления значения функции y = sin(a). 
(Класс Math).
*/
double x=3.14;
double y=Math.Sin(x);
System.Console.WriteLine(y);