/* Вывести на экран последнюю цифру целого числа введенного с клавиатуры. 
*/
int number=Convert.ToInt32(Console.ReadLine());
Console.WriteLine(number.ToString()[0]);
